/* Η ΚΛΑΣΗ ΑΝΑΠΑΡΙΣΤΑ ΤΗ ΒΟΗΘΕΙΑ ΤΟΥ ΜΕΝΟΥ */
import javax.swing.*;
import javax.swing.border.Border;
import java.awt.*;

public class Help extends JFrame {
    private final Border border = BorderFactory.createLineBorder(Color.BLACK, 5);
    private JPanel panel;
    private JLabel label;
    public Help()
    {
        createHelpFrame();
    }
    public void createHelpFrame()
    {
        /////
        ImageIcon imgIcon = new ImageIcon("./resources/logo.png"); // icon για το παράθυρο ...
        this.setSize(1920, 900);
        //this.setLayout(new FlowLayout());
        this.setDefaultCloseOperation(JFrame.DISPOSE_ON_CLOSE);
        this.setResizable(false);
        this.setLocationRelativeTo(null);
        this.setTitle("Help");
        this.setUndecorated(false);
        this.setIconImage(imgIcon.getImage());

        panel = new JPanel();
        panel.setBorder(border);

        label = new JLabel();
        label.setHorizontalAlignment(SwingConstants.CENTER);
        label.setVerticalAlignment(SwingConstants.CENTER);
        label.setForeground (Color.WHITE);
        label.setFont(new Font("Serif", Font.BOLD, 20));
        //label.setBorder(border);
        setLabelText(label);

        panel.add(label);
        this.add(panel);

        this.setVisible(true);
    }
    private void setLabelText(JLabel label)
    {
        label.setText(
                "<html>--Το παιχνίδι έχει σαν σκοπό την εύρεση λέξεων στο ταμπλό<br/>--Ο παίκτης πρέπει να σχηματίσει τις λέξεις επιλέγοντας ένα ένα τα γράμματα<br/>" +
                        "--Πατώντας τα κουτάκια έχει την δυνατότητα να επιλέξει τα γράμματα της λέξεις<br/>--Μπορεί να ακυρώσει την τελαιυταία επιλογή του πατώντας ένα απο τα γράμματα που έχει επιλέξει<br/>" +
                        "--Μπορεί να ακυρώσει όλες τις επιλογές του πατώντας το δεξί κλίκ στο ποντίκι του<br/>" +
                        "--Σε κάθε γράμμα αντιστοιχεί ένας βαθμός, οι βαθμοί συνυπολογίζονται καθώς πατιούνται τα κουτάκια<br/>" +
                        "--Στο ταμπλό υπάρχουν κόκκινα, μπλε, και κουτάκια μπαλαντέρ:<br/>" +
                        "----ΜΠΛΕ == διπλασιασμός των συνολικών πόντων της λέξης<br/>" +
                        "----ΚΟΚΚΙΝΟ == διπλασιασμός του πόντου του συγκεκριμένου γράμματος<br/>" +
                        "----ΜΠΑΛΑΝΤΕΡ == Δυνατότητα επιλογής γράμματος απο το παίκτη<br/>" +
                        "--Κάτω απο το ταμπλό εμφανίζονται ενδείξεις ανάλογα με τις κινήσεις του παίκτη στο παιχνίδι<br/><br/>" +
                        "--ΚΑΝΟΝΕΣ ΓΕΙΤΝΙΑΣΗΣ--<br/>" +
                        "----Τα γράμματα που επιλέγει το παίκτης κάθε φορά πρέπει να είναι γειτονικά του τελευταίου γράμματος<br/><br/>" +
                        "--Όταν θεωρήσει ότι ο παίκτης έχει βρεί μια λέξη μπορεί να πατήσει το κουμπί ΕΛΕΓΧΟΣ ΛΕΞΗΣ<br/>" +
                        "----Άμα η λέξη είναι σωστή τότε θα αντικατασταθούν τα γράμματα με καινούργια<br/>" +
                        "----Αν η λέξη είναι λάθος τότε θα αλλάξει η ένδειξη κάτω από το ταμπλό του παιχνιδιού<br/><br/>" +
                        "--ΠΟΤΕ ΝΙΚΑΕΙ Ο ΠΑΙΚΤΗΣ<br/>" +
                        "----Ο παίκτης θα έχει νικήσει όταν καταφέρει να συγκεντρώσει όλους τους πόντους που αναγράφονται στο πεδίο ..Στόχος..<br/>" +
                        "----Ακόμα και αν βρεί ένα επιθυμητό αριθμό απο λέξεων, βασική προϋπόθεση θα είναι να συγκεντρώσει όλους τους πόντους<br/><br/>" +
                        "--ΒΟΗΘΕΙΕΣ<br/>" +
                        "----Ο παίκτης έχει στην διάθεση του 5 βοήθειες, με συγκεκριμένο προκαθορισμένο αριθμό χρησιμοποιείσης τους, όμως μπορεί να αλλάξει το αριθμό αυτό κατά την διάρκεια του παιχνιδιού για την κάθε βοήθεια<br/><br/>" +
                        "--ΝΟΤΕ<br/>" +
                        "----Με την χρήση οποιαδήποτε βοηθείας δεν μετακινούνται θέση η μπαλαντέρ, αλλά ούτε και η θέσεις των κόκκινων και μπλε κουτιών<br/>" +
                        "----Μετακινούνται θέση όμως τα γράμματα τους<br/>" +
                        "---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/>"

        );
    }
}
